docs/dabbrev-is-superior.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dabbrev is superior</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">dabbrev is superior</h1>
</header><p>
People love automatic code completion.  In modern text editors/IDEs you'll always see a flashing window that suggests you what to type.  I think completion popup is overused.  I also think that logic behind that popup is too complex.  There's one feature in Emacs that only a few of people use which is superior to all types of completion found in other environments.  In this article I'll try to provide my arguments about how awesome <code>dabbrev</code> is.
</p>

<div id="outline-container-org7843fda" class="outline-2">
<h2 id="org7843fda">Dynamic abbreviations</h2>
<div class="outline-text-2" id="text-org7843fda">
<p>
From Emacs manual: <code>“dynamic abbrevs” allow the meanings of abbreviations to be determined automatically from the contents of the buffer, but dynamic abbrev expansion happens only when you request it explicitly</code>.
</p>

<p>
In fact <code>dabbrev</code> is just a command that tries to complete the word you're typing.  It looks into opened buffers and inserts first candidate.  By hitting <code>M-/</code> you can cycle through available completion condidates.  This feature is blazingly fast, it works in any buffer and just does the job out of the box without any configuration.
</p>

<p>
There are a couple of other things that make this package even nicer.  First, you can complete a series of words by hitting <code>&lt;SPC&gt; M-/</code> after completion.  Second, it is possible to filter buffers where search will happen.
</p>
</div>
</div>

<div id="outline-container-orgb3629dd" class="outline-2">
<h2 id="orgb3629dd">How it feels</h2>
<div class="outline-text-2" id="text-orgb3629dd">
<p>
To make my explanations easier I want to compare <code>dabbrev</code> with completion provided by <code>LSP</code>.  Suppose you're working on a project with libraries, and you just need autocompletion to work productively.
</p>

<p>
Generally there are two use cases for completion.
</p>
<ol class="org-ol">
<li>word, you're completing is too long; you want to type small part of that word and complete it.</li>
<li>you forgot how a symbol is named, you're lazy to look into documentation and want completion now.</li>
</ol>

<p>
For first case <code>dabbrev</code> works like a charm.  You just hit <code>M-/</code> and continue coding.  0 seconds.  <code>LSP</code> and other IDEs do not work that well in this case.  A completion window will pop up (if you're using Emacs you'll have to wait for that popup, let's be serious).  You'll have to look at that popup, search with your eyes for the needed entry, use arrow keys to navigate it and press enter.  Wow.  And people say that Emacs users type a lot of keybindings.
</p>

<p>
Most of the time <code>LSP</code> performs better in second case.  It's improtant to note that with Emacs it's not that hard to search for that symbol's name; there are plenty searching commands like <code>grep</code>, <code>occur</code> etc.  When used correctly they can operate very quickly.  Everyone will hate me but here are some tips that can user experience with <code>dabbrev</code>:
</p>
<ul class="org-ul">
<li>write in simple programming language that doesn't have namespaces.  Yep, C or Emacs Lisp, it doesn't matter.  You'll type a prefix for forgotten symbol and <code>dabbrev</code> will do the rest of the job.</li>
<li>write names that make sense in your code.  Trust me, it will be both easier to remember and easier to complete.</li>
</ul>

<p>
Wait, how about libraries? <code>dabbrev</code> works only with open buffers, right? Well, why not open all the needed library files? This simple approach allows <code>dabbrev</code> to complete functions and types from libraries.  Again, without any configuration.
</p>

<p>
You could notice that most of my arguments apply to programming in the C language.  That is correct, I've done most of my programming inside of Emacs in C.  It's worth noting that <code>dabbrev</code> works good with any other languages too, it just doesn't happen to feel the context of your code.
</p>

<p>
The only usecase (which happens relatively rarely based on your programming language of choice) is when you need to perform a context-sensitive completion.  For example, you typed module name, placed dot after it and want to complete a function name.  <code>dabbrev</code> doesn't solve this problem.  If this situation happens too often then I recommend a hybrid solution: use smart completion framework when you need to complete some context specific symbol and use <code>dabbrev</code> when you need to quickly complete a word that you typed before.
</p>
</div>
</div>

<div id="outline-container-org27e583c" class="outline-2">
<h2 id="org27e583c">Conclusion</h2>
<div class="outline-text-2" id="text-org27e583c">
<p>
I consider <code>dabbrev</code> to be the greatest completion framework at the moment.  It's simple, fast, predictable and doesn't eat 200 MB of memory.  When used correctly it can beat any other solution in most cases.  I didn't write about half of things I wanted to write, but I think this article got too long.  One last thing I should say about old development environment builtin into Emacs: there's something beatiful about it.  Emacs just admires <b>simplicity</b> in my editing routine and I love it.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-05-29</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>